<?php
$time = date('H'); // получаем время
if ($time >= 8 && $time <= 17) {
    $backgroundColor = '#fff'; // Белый цвет
} else {
    $backgroundColor = '#808080'; // Серый цвет
}

echo '<style>
body {
  background-color: ' . $backgroundColor . ';
}</style>';
include 'header.php';
?>
<!DOCTYPE html>
<html lang="en">
	<head>
		<meta charset="UTF-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1.0" />
		<meta name="keywords" content="php, html, css, bitix" />
		<title>Document</title>
		<link rel="stylesheet" href="../assets/css/style.css" />
	</head>
	<body>
		<div class="container">
			<div class="one"></div>
			<div class="name">
				<a>АНТОН ШУЛУПАНОВ</a>
			</div>

			<div class="two">
				Меня зовут Антон, и я учусь на первом курсе университета по
				специальности «Программирование».
				<br />
				С самого детства я любил компьютеры и всё, что с ними связано. Я часами
				мог сидеть за монитором, изучая новые программы и игры. В школе я начал
				изучать основы программирования, и это оказалось именно тем, чем я хотел
				заниматься всю жизнь.
				<br />
				Сейчас я учусь в университете, где получаю необходимые знания и навыки
				для того, чтобы стать профессиональным программистом. Каждый день я
				узнаю что-то новое, решаю задачи и пишу код. Это очень интересно и
				увлекательно, но также требует много усилий и времени.
				<br />
				Я уверен, что программирование — это моё призвание, и я готов приложить
				все усилия, чтобы достичь успеха в этой области. Я хочу создавать
				полезные и интересные программы, которые будут помогать людям в их
				повседневной жизни.
				<br />
				Конечно, учёба в университете — это только начало моего пути. Впереди
				меня ждёт ещё много работы и трудностей, но я готов к ним. Я верю, что
				если я буду продолжать учиться и развиваться, то смогу достичь своих
				целей и стать успешным программистом.
			</div>

			<div class="three">
				Меня зовут Антон, и я учусь на курсе по программированию. Я выбрал этот
				курс, потому что всегда интересовался компьютерами и всем, что с ними
				связано.
				<br />
				На курсе я изучаю основы программирования, алгоритмы, структуры данных и
				другие важные темы. Преподаватели — опытные профессионалы, которые
				помогают мне разобраться в сложных вопросах и научиться применять
				полученные знания на практике.
				<br />
				Я уверен, что сделал правильный выбор, решив посвятить свою жизнь
				программированию. Это очень интересная и перспективная область, которая
				постоянно развивается и предлагает множество возможностей для
				самореализации.
				<br />
				Конечно, учёба на курсе — это только начало моего пути. Впереди меня
				ждёт ещё много работы и трудностей, но я готов к ним. Я верю, что если я
				буду продолжать учиться и развиваться, то смогу достичь своих целей и
				стать востребованным специалистом.
			</div>
			<br />
			<div class="table3">
				<div class="ti">
					<div class="child1"></div>
					<div class="child2"></div>
					<div class="child3"></div>
					<div class="child4"></div>
				</div>
				<div class="tt">
					<div class="child5">Кот1</div>
					<div class="child6">Кот2</div>
					<div class="child7">Кот3</div>
					<div class="child8">Кот4</div>
				</div>
			</div>

			<div class="table4">
				<div class="tc1">
					<div class="child9"></div>
					<div class="car1"><p>Машина1</p></div>
					<div class="child10"></div>
					<div class="car2"><p>Машина2</p></div>
				</div>
				<div class="tc3">
					<div class="child11"></div>
					<div class="car3"><p>Машина3</p></div>
					<div class="child12"></div>
					<div class="car4"><p>Машина4</p></div>
				</div>
			</div>
		</div>
	</body>
</html>
<?php
include 'footer.php';
?>

